Revit 2027 API
IFCTransformSetter Methods
The IFCTransformSetter type exposes the following members.
Methods
Name | Description
Create |  Creates a new instance of a transform setter.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Initialize |  Initializes the transformation in the transform setter.
InitializeFromBoundingBox
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
IFCTransformSetter Class
Autodesk.Revit.DB.IFC Namespace